cf_billing/InformationRegisters/энргНастройкиПечатныхФорм.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргНастройкиПечатныхФорм</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеПараметра</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектМетаданных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргНастройкиПечатныхФорм/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура ОбновитьДопустимыеНастройки() Экспорт
	
	Имя 								= Метаданные.Обработки.энргПечатьДоговора.Имя;	
	МассивНастроек  					= Новый Массив;
	МассивНастроек.Добавить("Должность");
	МассивНастроек.Добавить("НомерДоверенности");
	МассивНастроек.Добавить("ДатаДоверенности");
	МассивНастроек.Добавить("ТерриториальныйМенеджер");
	
	для Каждого ЗначениеНастройки из МассивНастроек цикл
		Набор 								= РегистрыСведений.энргНастройкиПечатныхФорм.СоздатьНаборЗаписей();
		Набор.Отбор.ОбъектМетаданных.установить("Обработка." + Имя);
		Набор.Отбор.Параметр.установить(ЗначениеНастройки);
		Набор.Прочитать();
		Если Набор.Количество() = 0 тогда
			СтрокаНабора  					= Набор.Добавить();
			СтрокаНабора.ОбъектМетаданных 	= "Обработка." + Имя;
			СтрокаНабора.Параметр 			= ЗначениеНастройки;
			Набор.Записать();
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

#КонецЕсли
